Tekla Open API Reference for Tekla Structures 2025
GraphicObject.GraphicObjectAttributes Constructor
 Creates a new graphic object attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GraphicObjectAttributes()
Public Sub New
See Also
Reference
GraphicObject.GraphicObjectAttributes Class
GraphicObject.GraphicObjectAttributes Overload
Tekla.Structures.Drawing Namespace